# LinearConstraintNotParallel Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DimensionFailures..::..LinearConstraintNotParallel Property
BuiltInFailures..::..DimensionFailures Class See Also
---
The References of the highlighted Dimension are no longer parallel.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId LinearConstraintNotParallel { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property LinearConstraintNotParallel As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ LinearConstraintNotParallel {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DimensionFailures Class
Autodesk.Revit.DB Namespace